{"format": "graph-model", "generatedBy": "2.11.0", "convertedBy": "TensorFlow.js Converter v4.2.0", "signature": {"inputs": {"xs_0": {"name": "xs_0:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "92"}, {"size": "92"}]}}}}, "modelTopology": {"node": [{"name": "PartitionedCall/jax2tf_main_/vmap/vmap/transpose/jax2tf_main_/vmap/vmap/jvp/Const_5", "op": "Const", "attr": {"dtype": {"type": "DT_BOOL"}, "value": {"tensor": {"dtype": "DT_BOOL", "tensorShape": {}}}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/transpose/jax2tf_main_/vmap/vmap/jvp/pjit_absolute_/BroadcastTo_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "92"}, {"size": "92"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/jvp/Const_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/transpose/jax2tf_main_/vmap/vmap/jvp/Const_3", "op": "Const", "attr": {"dtype": {"type": "DT_BOOL"}, "value": {"tensor": {"dtype": "DT_BOOL", "tensorShape": {}}}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/jvp/Const_3", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/jvp/pjit_norm_/Sum/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/transpose/jax2tf_main_/vmap/vmap/jvp/pjit_norm_/Reshape/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/transpose/jax2tf_main_/vmap/vmap/jvp/pjit_norm_/BroadcastTo/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_68/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_65/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_62/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_59/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_56/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_53/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_50/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_47/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_44/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_41/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_38/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_35/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_32/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_29/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_26/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_23/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_20/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_17/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_14/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_11/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_8/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_2/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/BroadcastTo_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "92"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_6/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/BroadcastTo_4", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "92"}, {"size": "1"}]}}}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/Reshape_15/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/clip_by_value_8", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/add_8", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/ones_like_8", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/clip_by_value_11", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/add_11", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/ones_like_11", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/Reshape_16/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/clip_by_value_6", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/add_6", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/ones_like_6", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/clip_by_value_10", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/add_10", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/ones_like_10", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/clip_by_value_7", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/add_7", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/ones_like_7", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/Reshape_6/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/clip_by_value_5", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/add_5", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/ones_like_5", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/Reshape_1/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/BroadcastTo_2", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/concat/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/Reshape_6/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/Reshape_3/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_main_/clip_by_value", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_main_/Slice/size", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "PartitionedCall/jax2tf_main_/Reshape/shape_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{}]}}}}}, {"name": "ConstantFolding/PartitionedCall/jax2tf_main_/vmap/vmap/pjit_true_divide_/truediv_1_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/Reshape_4/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/BroadcastTo_5", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/Reshape_7/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/BroadcastTo_8", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/concat_2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_matmul_/ExpandDims", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_1/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/clip_by_value_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/add_3", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/ones_like_3", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/Reshape_8/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_2/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/clip_by_value_9", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/add_9", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/ones_like_9", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/Reshape_17/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/concat_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_3/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_5/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_3/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_true_divide_/Reshape/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/BroadcastTo_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_4/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "PartitionedCall/Const_27", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_9/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/BroadcastTo_3", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}]}}}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_5/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "PartitionedCall/Const_32", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_12/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/BroadcastTo_5", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_6/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Const_35", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_15/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/BroadcastTo_7", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_7/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "PartitionedCall/Const_38", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_18/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/BroadcastTo_9", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}]}}}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_8/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "PartitionedCall/Const_41", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_21/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/BroadcastTo_11", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_9/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Const_44", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_24/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/BroadcastTo_13", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_10/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Const_47", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_27/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/BroadcastTo_15", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_11/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "PartitionedCall/Const_50", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_30/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/BroadcastTo_17", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_12/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "PartitionedCall/Const_53", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_33/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/BroadcastTo_19", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_13/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "PartitionedCall/Const_56", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_36/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/BroadcastTo_21", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_14/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "PartitionedCall/Const_59", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_39/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/BroadcastTo_23", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_15/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Const_62", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_42/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/BroadcastTo_25", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_16/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "PartitionedCall/Const_65", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_45/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/BroadcastTo_27", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_17/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Const_68", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_48/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/BroadcastTo_29", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_18/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "PartitionedCall/Const_71", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_51/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/BroadcastTo_31", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_19/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Const_74", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_54/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/BroadcastTo_33", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}]}}}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_20/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "PartitionedCall/Const_77", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_57/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/BroadcastTo_35", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_21/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "PartitionedCall/Const_80", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_60/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/BroadcastTo_37", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}]}}}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_22/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Const_83", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_63/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/BroadcastTo_39", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_23/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Const_86", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_66/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/jvp/pjit__lambda__/BroadcastTo_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/transpose/jax2tf_main_/vmap/vmap/jvp/pjit_absolute_/BroadcastTo_2", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "92"}, {"size": "92"}, {"size": "3"}]}}}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_24/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_true_divide_/Reshape_1/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_true_divide_/truediv", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/PartitionedCall/jax2tf_main_/vmap/vmap/pjit_true_divide_/truediv_6_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "xs_0", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_main_/Slice", "op": "Slice", "input": ["xs_0", "PartitionedCall/jax2tf_main_/clip_by_value", "PartitionedCall/jax2tf_main_/Slice/size"], "attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_main_/Reshape", "op": "Reshape", "input": ["PartitionedCall/jax2tf_main_/Slice", "PartitionedCall/jax2tf_main_/Reshape/shape_1"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_true_divide_/truediv_1", "op": "Mul", "input": ["PartitionedCall/jax2tf_main_/Reshape", "ConstantFolding/PartitionedCall/jax2tf_main_/vmap/vmap/pjit_true_divide_/truediv_1_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/Sin", "op": "Sin", "input": ["PartitionedCall/jax2tf_main_/vmap/vmap/pjit_true_divide_/truediv_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/Cos", "op": "Cos", "input": ["PartitionedCall/jax2tf_main_/vmap/vmap/pjit_true_divide_/truediv_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/Neg", "op": "Neg", "input": ["PartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/Sin"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/Reshape_3", "op": "Reshape", "input": ["PartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/Sin", "PartitionedCall/jax2tf_main_/vmap/vmap/Reshape_3/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/Reshape", "op": "Reshape", "input": ["PartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/Cos", "PartitionedCall/jax2tf_main_/vmap/vmap/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/Reshape_4", "op": "Reshape", "input": ["PartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/Cos", "PartitionedCall/jax2tf_main_/vmap/vmap/Reshape_4/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/Reshape_1", "op": "Reshape", "input": ["PartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/Neg", "PartitionedCall/jax2tf_main_/vmap/vmap/Reshape_1/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/concat_1", "op": "ConcatV2", "input": ["PartitionedCall/jax2tf_main_/vmap/vmap/Reshape_3", "PartitionedCall/jax2tf_main_/vmap/vmap/Reshape_4", "PartitionedCall/jax2tf_main_/vmap/vmap/BroadcastTo_5", "PartitionedCall/jax2tf_main_/vmap/vmap/concat_1/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "N": {"i": "3"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/concat", "op": "ConcatV2", "input": ["PartitionedCall/jax2tf_main_/vmap/vmap/Reshape", "PartitionedCall/jax2tf_main_/vmap/vmap/Reshape_1", "PartitionedCall/jax2tf_main_/vmap/vmap/BroadcastTo_2", "PartitionedCall/jax2tf_main_/vmap/vmap/concat/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "N": {"i": "3"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/Reshape_7", "op": "Reshape", "input": ["PartitionedCall/jax2tf_main_/vmap/vmap/concat_1", "PartitionedCall/jax2tf_main_/vmap/vmap/Reshape_7/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/Reshape_6", "op": "Reshape", "input": ["PartitionedCall/jax2tf_main_/vmap/vmap/concat", "PartitionedCall/jax2tf_main_/vmap/vmap/Reshape_6/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/concat_2", "op": "ConcatV2", "input": ["PartitionedCall/jax2tf_main_/vmap/vmap/Reshape_6", "PartitionedCall/jax2tf_main_/vmap/vmap/Reshape_7", "PartitionedCall/jax2tf_main_/vmap/vmap/BroadcastTo_8", "PartitionedCall/jax2tf_main_/vmap/vmap/concat_2/axis"], "attr": {"N": {"i": "3"}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_matmul_/MatMul", "op": "MatMul", "input": ["PartitionedCall/jax2tf_main_/vmap/vmap/concat_2", "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_matmul_/ExpandDims"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_matmul_/Squeeze", "op": "Squeeze", "input": ["PartitionedCall/jax2tf_main_/vmap/vmap/pjit_matmul_/MatMul"], "attr": {"squeeze_dims": {"list": {"i": ["1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_68", "op": "Reshape", "input": ["PartitionedCall/jax2tf_main_/vmap/vmap/pjit_matmul_/Squeeze", "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_68/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_65", "op": "Reshape", "input": ["PartitionedCall/jax2tf_main_/vmap/vmap/pjit_matmul_/Squeeze", "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_65/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_62", "op": "Reshape", "input": ["PartitionedCall/jax2tf_main_/vmap/vmap/pjit_matmul_/Squeeze", "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_62/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_59", "op": "Reshape", "input": ["PartitionedCall/jax2tf_main_/vmap/vmap/pjit_matmul_/Squeeze", "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_59/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_56", "op": "Reshape", "input": ["PartitionedCall/jax2tf_main_/vmap/vmap/pjit_matmul_/Squeeze", "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_56/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_53", "op": "Reshape", "input": ["PartitionedCall/jax2tf_main_/vmap/vmap/pjit_matmul_/Squeeze", "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_53/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_50", "op": "Reshape", "input": ["PartitionedCall/jax2tf_main_/vmap/vmap/pjit_matmul_/Squeeze", "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_50/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_47", "op": "Reshape", "input": ["PartitionedCall/jax2tf_main_/vmap/vmap/pjit_matmul_/Squeeze", "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_47/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_44", "op": "Reshape", "input": ["PartitionedCall/jax2tf_main_/vmap/vmap/pjit_matmul_/Squeeze", "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_44/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_41", "op": "Reshape", "input": ["PartitionedCall/jax2tf_main_/vmap/vmap/pjit_matmul_/Squeeze", "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_41/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_38", "op": "Reshape", "input": ["PartitionedCall/jax2tf_main_/vmap/vmap/pjit_matmul_/Squeeze", "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_38/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_35", "op": "Reshape", "input": ["PartitionedCall/jax2tf_main_/vmap/vmap/pjit_matmul_/Squeeze", "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_35/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_32", "op": "Reshape", "input": ["PartitionedCall/jax2tf_main_/vmap/vmap/pjit_matmul_/Squeeze", "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_32/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_29", "op": "Reshape", "input": ["PartitionedCall/jax2tf_main_/vmap/vmap/pjit_matmul_/Squeeze", "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_29/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_26", "op": "Reshape", "input": ["PartitionedCall/jax2tf_main_/vmap/vmap/pjit_matmul_/Squeeze", "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_26/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_23", "op": "Reshape", "input": ["PartitionedCall/jax2tf_main_/vmap/vmap/pjit_matmul_/Squeeze", "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_23/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_20", "op": "Reshape", "input": ["PartitionedCall/jax2tf_main_/vmap/vmap/pjit_matmul_/Squeeze", "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_20/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_17", "op": "Reshape", "input": ["PartitionedCall/jax2tf_main_/vmap/vmap/pjit_matmul_/Squeeze", "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_17/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_14", "op": "Reshape", "input": ["PartitionedCall/jax2tf_main_/vmap/vmap/pjit_matmul_/Squeeze", "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_14/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_11", "op": "Reshape", "input": ["PartitionedCall/jax2tf_main_/vmap/vmap/pjit_matmul_/Squeeze", "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_11/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_8", "op": "Reshape", "input": ["PartitionedCall/jax2tf_main_/vmap/vmap/pjit_matmul_/Squeeze", "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_8/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/Sub", "op": "Neg", "input": ["PartitionedCall/jax2tf_main_/vmap/vmap/pjit_matmul_/Squeeze"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/ArithmeticOptimizer/ReplaceMulWithSquare_Mul_1", "op": "Square", "input": ["PartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/Sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": 